CSI API ETABS v1
cDesignConcrete.GetSummaryResultsBeam_2 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSummaryResultsBeam_2(
	string Name,
	ref int NumberItems,
	ref string[] FrameName,
	ref double[] Location,
	ref string[] TopCombo,
	ref double[] TopArea,
	ref double[] TopAreaReq,
	ref double[] TopAreaMin,
	ref double[] TopAreaProvided,
	ref string[] BotCombo,
	ref double[] BotArea,
	ref double[] BotAreaReq,
	ref double[] BotAreaMin,
	ref double[] BotAreaProvided,
	ref string[] VmajorCombo,
	ref double[] VmajorArea,
	ref double[] VmajorAreaReq,
	ref double[] VmajorAreaMin,
	ref double[] VmajorAreaProvided,
	ref string[] TLCombo,
	ref double[] TLArea,
	ref string[] TTCombo,
	ref double[] TTArea,
	ref string[] ErrorSummary,
	ref string[] WarningSummary,
	eItemType ItemType = eItemType.Objects
)
Function GetSummaryResultsBeam_2 (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef FrameName As String(),
	ByRef Location As Double(),
	ByRef TopCombo As String(),
	ByRef TopArea As Double(),
	ByRef TopAreaReq As Double(),
	ByRef TopAreaMin As Double(),
	ByRef TopAreaProvided As Double(),
	ByRef BotCombo As String(),
	ByRef BotArea As Double(),
	ByRef BotAreaReq As Double(),
	ByRef BotAreaMin As Double(),
	ByRef BotAreaProvided As Double(),
	ByRef VmajorCombo As String(),
	ByRef VmajorArea As Double(),
	ByRef VmajorAreaReq As Double(),
	ByRef VmajorAreaMin As Double(),
	ByRef VmajorAreaProvided As Double(),
	ByRef TLCombo As String(),
	ByRef TLArea As Double(),
	ByRef TTCombo As String(),
	ByRef TTArea As Double(),
	ByRef ErrorSummary As String(),
	ByRef WarningSummary As String(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDesignConcrete
Dim Name As String
Dim NumberItems As Integer
Dim FrameName As String()
Dim Location As Double()
Dim TopCombo As String()
Dim TopArea As Double()
Dim TopAreaReq As Double()
Dim TopAreaMin As Double()
Dim TopAreaProvided As Double()
Dim BotCombo As String()
Dim BotArea As Double()
Dim BotAreaReq As Double()
Dim BotAreaMin As Double()
Dim BotAreaProvided As Double()
Dim VmajorCombo As String()
Dim VmajorArea As Double()
Dim VmajorAreaReq As Double()
Dim VmajorAreaMin As Double()
Dim VmajorAreaProvided As Double()
Dim TLCombo As String()
Dim TLArea As Double()
Dim TTCombo As String()
Dim TTArea As Double()
Dim ErrorSummary As String()
Dim WarningSummary As String()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetSummaryResultsBeam_2(Name,
	NumberItems, FrameName, Location,
	TopCombo, TopArea, TopAreaReq, TopAreaMin,
	TopAreaProvided, BotCombo, BotArea,
	BotAreaReq, BotAreaMin, BotAreaProvided,
	VmajorCombo, VmajorArea, VmajorAreaReq,
	VmajorAreaMin, VmajorAreaProvided,
	TLCombo, TLArea, TTCombo, TTArea,
	ErrorSummary, WarningSummary, ItemType)
int GetSummaryResultsBeam_2(
	String^ Name,
	int% NumberItems,
	array<String^>^% FrameName,
	array<double>^% Location,
	array<String^>^% TopCombo,
	array<double>^% TopArea,
	array<double>^% TopAreaReq,
	array<double>^% TopAreaMin,
	array<double>^% TopAreaProvided,
	array<String^>^% BotCombo,
	array<double>^% BotArea,
	array<double>^% BotAreaReq,
	array<double>^% BotAreaMin,
	array<double>^% BotAreaProvided,
	array<String^>^% VmajorCombo,
	array<double>^% VmajorArea,
	array<double>^% VmajorAreaReq,
	array<double>^% VmajorAreaMin,
	array<double>^% VmajorAreaProvided,
	array<String^>^% TLCombo,
	array<double>^% TLArea,
	array<String^>^% TTCombo,
	array<double>^% TTArea,
	array<String^>^% ErrorSummary,
	array<String^>^% WarningSummary,
	eItemType ItemType = eItemType::Objects
)
abstract GetSummaryResultsBeam_2 :
        Name : string *
        NumberItems : int byref *
        FrameName : string[] byref *
        Location : float[] byref *
        TopCombo : string[] byref *
        TopArea : float[] byref *
        TopAreaReq : float[] byref *
        TopAreaMin : float[] byref *
        TopAreaProvided : float[] byref *
        BotCombo : string[] byref *
        BotArea : float[] byref *
        BotAreaReq : float[] byref *
        BotAreaMin : float[] byref *
        BotAreaProvided : float[] byref *
        VmajorCombo : string[] byref *
        VmajorArea : float[] byref *
        VmajorAreaReq : float[] byref *
        VmajorAreaMin : float[] byref *
        VmajorAreaProvided : float[] byref *
        TLCombo : string[] byref *
        TLArea : float[] byref *
        TTCombo : string[] byref *
        TTArea : float[] byref *
        ErrorSummary : string[] byref *
        WarningSummary : string[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
FrameName
Type: System.String[]
Location
Type: System.Double[]
TopCombo
Type: System.String[]
TopArea
Type: System.Double[]
TopAreaReq
Type: System.Double[]
TopAreaMin
Type: System.Double[]
TopAreaProvided
Type: System.Double[]
BotCombo
Type: System.String[]
BotArea
Type: System.Double[]
BotAreaReq
Type: System.Double[]
BotAreaMin
Type: System.Double[]
BotAreaProvided
Type: System.Double[]
VmajorCombo
Type: System.String[]
VmajorArea
Type: System.Double[]
VmajorAreaReq
Type: System.Double[]
VmajorAreaMin
Type: System.Double[]
VmajorAreaProvided
Type: System.Double[]
TLCombo
Type: System.String[]
TLArea
Type: System.Double[]
TTCombo
Type: System.String[]
TTArea
Type: System.Double[]
ErrorSummary
Type: System.String[]
WarningSummary
Type: System.String[]
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cDesignConcrete Interface
ETABSv1 Namespace